__tests__/loadTest.yml
config:
  target: "http://localhost:3004/products/9999999/gallery"
  phases:
    - duration: 60
      arrivalRate: 1000   
scenarios:
  - flow:
      - get:
          url: "/"
  # payload:
  #   path: "urls.txt"
  #   fields:
  #     - "url"

# scenarios:
#   -
#     name: "call all url's"
#     flow:
#       -
#         get:
#           url: "{{ url }}"
#artillery run loadTest.yml